<template>
  <div>
    <b-tabs>
      <b-tab title="1: Санаторій Україна - Аврора" active>
        <b-table responsive :items="items"></b-table>
      </b-tab>
      <b-tab title="1A: Вулиця Пацаєва - Санаторій Україна">
      </b-tab>
    </b-tabs>
    <!--TODO: remove it after using items2 for table-->
    <div> {{items2}}} </div>
  </div>
</template>

<script>
import TroleybusSchedulesService from '@/services/TroleybusSchedulesService'


export default {
  data () {
    return {
      items: [
        {
          'Напрямок': 'ЧЛФЗ "Аврора" - сан.Україна',
          'ЧЛФЗ "Аврора"': '10:00',
          'завод Хімреактив': '10:05',
          'ДОК': '10:10',
          'Хлібзавод': '10:15',
          'вул.Добровольського': '10:20',
          'пл.700-річчя Черкас': '10:25',
          'Університет': '10:30',
          'DEPOt center': '10:35',
          'вул.Новопречистенська': '10:40',
          'вул.Кривалівська': '10:45',
          'вул.Пастерівська': '10:50',
          'пл.Богдана Хмельницького': '10:55',
          'Будинок Торгівлі': '11:00',
          'пл.Соборна': '11:05',
          'пл.Слави': '11:10',
          'вул.Пушкіна': '11:15',
          'Університет': '11:20',
          'вул.Казбетська': '11:25',
          'вул.Можайського': '11:30',
          'Агропроммеханізація': '11:35',
          'Міська лікарня №1': '11:40',
          'Обласна лікарня': '11:45',
          'м/н Сосновка': '11:50',
          'Міська лікарня №2': '11:55',
          'Лісгосп': '12:00',
          'санаторій Україна': '12:05'
        },
        {
          'Напрямок': 'сан.Україна - ЧЛФЗ "Аврора"',
          'ЧЛФЗ "Аврора"': '10:00',
          'завод Хімреактив': '10:05',
          'ДОК': '10:10',
          'Хлібзавод': '10:15',
          'вул.Добровольського': '10:20',
          'пл.700-річчя Черкас': '10:25',
          'Університет': '10:30',
          'DEPO`t center': '10:35',
          'вул.Новопречистенська': '10:40',
          'вул.Кривалівська': '10:45',
          'вул.Пастерівська': '10:50',
          'пл.Богдана Хмельницького': '10:55',
          'Будинок Торгівлі': '11:00',
          'пл.Соборна': '11:05',
          'пл.Слави': '11:10',
          'вул.Пушкіна': '11:15',
          'Університет': '11:20',
          'вул.Казбетська': '11:25',
          'вул.Можайського': '11:30',
          'Агропроммеханізація': '11:35',
          'Міська лікарня №1': '11:40',
          'Обласна лікарня': '11:45',
          'м/н Сосновка': '11:50',
          'Міська лікарня №2': '11:55',
          'Лісгосп': '12:00',
          'санаторій Україна': '12:05'
        }
      ],
      items2: [] // TODO: replace items into items2 and rename items2 to items
    }
  },
  mounted () {
    this.getTroleybusSchedules()
  },
  methods: {
    async getTroleybusSchedules () {
      const response = await TroleybusSchedulesService.fetchTroleybusSchedules()
      this.items2 = response.data
    }
  }
}
</script>

<style>
  .nav {
    margin-top: 30px;
  }
</style>
